:PROPERTIES:
:ID:       475a26b8-ef8f-42fa-aebc-12345850cd7b
:END:
#+title: Guix Golang: Makefile Graph

* Anways

lol. ok wow opnsense (that's what ports are written with, i guess)

#+begin_src shell :results output table
for r in $(ls $_ECTO); do
    if [[ -d "$_ECTO/$r" ]]; then
        n=$(locate -r "/data/ecto/${r}/.*/Makefile\$" | wc -l)
        echo $r $n
    fi
done
#+end_src

#+RESULTS:
| ansible              |   15 |
| ansible-collections  |   15 |
| astral               |    3 |
| astro-themes         |    0 |
| blender              |    8 |
| crypto               |   28 |
| emacs                |   34 |
| finance              |    0 |
| frc                  |   77 |
| FreeCAD              |  112 |
| guix                 |   18 |
| guixrus              |    0 |
| hacknet              |   14 |
| hashicorp            |  115 |
| kde                  |   44 |
| keyboard             |    1 |
| mkroa                |    1 |
| nyxt                 |    0 |
| opencascade          |    0 |
| pfsense              | 5715 |
| python               |   26 |
| river                |    0 |
| ROCmSoftwarePlatform |  971 |
| rust                 |  355 |
| scala                |    2 |
| scheme               |   18 |
| sway                 |    6 |
| tensorflow           |   26 |
| typescript           |    4 |
| vyos                 |  226 |
| x.files              |   80 |

It'd be nice to switch the target from some packages and produce docs/diagrams
instead. You'd basically inherit the package, replace build with steps for docs,
then emit the diagrams .... doesn't really work for kinda most stuff though.
Usually you want a mix or granular control.
